In [5]:
import pandas as pd

In [11]:
# Series
a=pd.Series([1, 2, 3, 4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
type(a)

pandas.core.series.Series

In [4]:
a[0]

1

In [5]:
b=pd.Series((1, 2, 3, 5))
b

0    1
1    2
2    3
3    5
dtype: int64

In [6]:
c=pd.Series({"Roll No":[1, 2, 3, 4], 'Age':[24, 25, 26]})
c
d=pd.Series({0:1, 1:2, 2:3})
d

0    1
1    2
2    3
dtype: int64

In [7]:
e=pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], index=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12])
e

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
dtype: int64

In [10]:
e.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
e.tail()

8      9
9     10
10    11
11    12
12    13
dtype: int64

In [9]:
e.head(3)

0    1
1    2
2    3
dtype: int64

In [31]:
e.tail(6)

7      8
8      9
9     10
10    11
11    12
12    13
dtype: int64

In [15]:
import numpy as np
a=np.array([1, 2, 3, 4])
f=pd.Series(a, index=['a', 'b', 'c', 'd'])
f

a    1
b    2
c    3
d    4
dtype: int32

In [16]:
g=pd.Series([1, 3, 5, 7, 9, 11, 3, 6, 5, 11])
g.value_counts()

3     2
5     2
11    2
1     1
7     1
9     1
6     1
Name: count, dtype: int64

In [43]:
g.values

array([ 1,  3,  5,  7,  9, 11,  3,  6,  5, 11], dtype=int64)

In [44]:
g.index

RangeIndex(start=0, stop=10, step=1)

In [45]:
# filter
g[g>5]

3     7
4     9
5    11
7     6
9    11
dtype: int64

In [12]:
h=pd.Series([1, 3, 5, 7, 9, 11, 3, 6, 5, 11])
i=pd.Series([1, 3, 5, 7, 9])
# Addition
h+i

0     2.0
1     6.0
2    10.0
3    14.0
4    18.0
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

In [13]:
# Subtraction
h-i

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [14]:
# Multiplication
h*i

0     1.0
1     9.0
2    25.0
3    49.0
4    81.0
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

In [15]:
# Division
h/i

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [51]:
# Data Frame

In [16]:
df=pd.DataFrame({"Roll No" : [1, 2, 3, 4], "Age" : (25, 26, 27, 28), "Address" : ['A-14', 'B/16', 'C-24', 'Y12']})
df

   Roll No  Age Address
0        1   25    A-14
1        2   26    B/16
2        3   27    C-24
3        4   28     Y12

In [17]:
a=[[1, 2, 3], [4, 5, 6], [7, 8, 9]]
a

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [7]:
df1=pd.DataFrame(a, columns=["Ankit", "Rohit", "Anika"], index=['a', 'b', 'c'])
df1

NameError: name 'a' is not defined

In [19]:
df2=pd.DataFrame({"Name":['A', 'B', 'C'], 'Age':[24, 25, 26], "Id":[111, 112, 113]})
df2

  Name  Age   Id
0    A   24  111
1    B   25  112
2    C   26  113

In [20]:
df2.iloc[[1,2],[0,1,2]]

  Name  Age   Id
1    B   25  112
2    C   26  113

In [21]:
df2[df2["Name"]=='B']

  Name  Age   Id
1    B   25  112

In [22]:
df2[df2["Name"]=='B'][["Age", "Id"]]

   Age   Id
1   25  112

In [23]:
df2["Salary"]=[1200, 1400, 1600]
df2

  Name  Age   Id  Salary
0    A   24  111    1200
1    B   25  112    1400
2    C   26  113    1600

In [24]:
df2=pd.DataFrame({"Name":['A', 'B', 'C'], 'Age':[24, 25, 26], "Id":[111, 112, 113]})
df2

  Name  Age   Id
0    A   24  111
1    B   25  112
2    C   26  113

In [25]:
df3=pd.DataFrame({'Name':['D'], 'Age':[27], 'Id':[114],})
df3

  Name  Age   Id
0    D   27  114

In [26]:
pd.concat([df2, df3], ignore_index=True)

  Name  Age   Id
0    A   24  111
1    B   25  112
2    C   26  113
3    D   27  114

In [28]:
df2.iloc[[0],[0, 1, 2]]
df2.loc[[0, 2], ['Age', 'Id']]

   Age   Id
0   24  111
2   26  113

In [29]:
import pandas as pd

data = pd.DataFrame({'values': [50, 100, 150, 200, 250]})
data['normalized'] = (data['values'] - data['values'].min()) / (data['values'].max() - data['values'].min())

print(data)

   values  normalized
0      50        0.00
1     100        0.25
2     150        0.50
3     200        0.75
4     250        1.00

In [30]:
 data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data, index=['a', 'b', 'c'])
print(df)
# Select a single row by label
print(df.loc['a'])  

# Select specific rows and columns by label
print(df.loc[['a', 'c'], ['Name', 'City']])

# Select rows using a condition
print(df.loc[df['Age'] > 28])

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago
Name       Alice
Age           25
City    New York
Name: a, dtype: object
      Name      City
a    Alice  New York
c  Charlie   Chicago
      Name  Age         City
b      Bob   30  Los Angeles
c  Charlie   35      Chicago

In [31]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data, index=['a', 'b', 'c'])
print(df)
print(df.iloc[0])  

# Select specific rows and columns by position
print(df.iloc[[0, 2], [0, 2]])

# Select a slice of rows and columns
print(df.iloc[0:2, 1:3])

      Name  Age         City
a    Alice   25     New York
b      Bob   30  Los Angeles
c  Charlie   35      Chicago
Name       Alice
Age           25
City    New York
Name: a, dtype: object
      Name      City
a    Alice  New York
c  Charlie   Chicago
   Age         City
a   25     New York
b   30  Los Angeles

In [153]:
data = {
    "ID": [1, 2, 3, 4, 5],
    "Name": ["John Smith", "Jane Doe", "Alice Lee", "Bob Brown", "Emma Green"],
    "Department": ["IT", "HR", "IT", "Marketing", "HR"],
    "Salary": [60000, 50000, 70000, 45000, 55000],
    "Joining Date": ["2018-05-21", "2020-07-15", "2016-03-11", "2019-01-10", "2021-06-25"],
    "Experience (Years)": [5, 3, 7, 4, 2],
}
# Create DataFrame
emp_data=pd.DataFrame(data)
# Save DataFrame
emp_data.to_csv("F:/Pandas Practice Data/employee_data.csv")

In [154]:
data = {
    "Date": ["2025-01-01", "2025-01-01", "2025-01-02", "2025-01-02", "2025-01-03", "2025-01-03"],
    "Product": ["Widget A", "Widget B", "Widget A", "Widget C", "Widget B", "Widget C"],
    "Region": ["North", "South", "East", "West", "North", "South"],
    "Units Sold": [100, 200, 150, 300, 250, 100],
    "Price Per Unit": [25, 30, 25, 20, 30, 20],
}

# Create DataFrame
sal_data = pd.DataFrame(data)
# Save DataFrame
sal_data.to_csv("F:/Pandas Practice Data/sales_data.csv")

In [155]:
# file from System reading
# Read the data: Load the sales_data.csv file into a DataFrame.
df=pd.read_csv("F:/Pandas Practice Data/Sales_data.csv")
df

   Unnamed: 0        Date   Product Region  Units Sold  Price Per Unit
0           0  2025-01-01  Widget A  North         100              25
1           1  2025-01-01  Widget B  South         200              30
2           2  2025-01-02  Widget A   East         150              25
3           3  2025-01-02  Widget C   West         300              20
4           4  2025-01-03  Widget B  North         250              30
5           5  2025-01-03  Widget C  South         100              20

In [156]:
# Add a column: Add a new column, Total Sales, which is the product of Units Sold and Price Per Unit.
df["Total Sales"]=df["Units Sold"]*df["Price Per Unit"]
df

,Unnamed: 0,Date,Product,Region,Units Sold,Price Per Unit,Total Sales
0,0,2025-01-01,Widget A,North,100,25,2500
1,1,2025-01-01,Widget B,South,200,30,6000
2,2,2025-01-02,Widget A,East,150,25,3750
3,3,2025-01-02,Widget C,West,300,20,6000
4,4,2025-01-03,Widget B,North,250,30,7500
5,5,2025-01-03,Widget C,South,100,20,2000

In [157]:
# Filter data: Find all rows where the Total Sales is greater than 5000.
Filter_data=df[df["Total Sales"]>5000]
Filter_data

,Unnamed: 0,Date,Product,Region,Units Sold,Price Per Unit,Total Sales
1,1,2025-01-01,Widget B,South,200,30,6000
3,3,2025-01-02,Widget C,West,300,20,6000
4,4,2025-01-03,Widget B,North,250,30,7500

In [158]:
# Group by: Group the data by Region and calculate the total sales for each region.
region_sales = df.groupby("Region")["Total Sales"].sum()
region_sales

Region
East      3750
North    10000
South     8000
West      6000
Name: Total Sales, dtype: int64

In [76]:
# Sort: Sort the data by Total Sales in descending order.
sorted_df = df.sort_values("Total Sales", ascending=False)
sorted_df

         Date   Product Region  Units Sold  Price Per Unit  Total Sales
4  03-01-2025  Widget B  North         250              30         7500
1  01-01-2025  Widget B  South         200              30         6000
3  02-01-2025  Widget C   West         300              20         6000
2  02-01-2025  Widget A   East         150              25         3750
0  01-01-2025  Widget A  North         100              25         2500
5  03-01-2025  Widget C  South         100              20         2000

In [159]:
# Export: Save the updated DataFrame to a new CSV file called updated_sales_data.csv.
sorted_df.to_csv('F:/Pandas Practice Data/Updated_sales.csv', index=False)

In [161]:
# 1. Read the data: Load the employee_data.csv file into a DataFrame.
df1=pd.read_csv("F:/Pandas Practice Data/employee_data.csv")
df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years)
0,0,1,John Smith,IT,60000,2018-05-21,5
1,1,2,Jane Doe,HR,50000,2020-07-15,3
2,2,3,Alice Lee,IT,70000,2016-03-11,7
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4
4,4,5,Emma Green,HR,55000,2021-06-25,2

In [162]:
#  2. Filter Rows: Find all employees in the "IT" department with a salary greater than 60,000.
Filter_df1=df1[(df1["Department"] == "IT") & (df1["Salary"] > 60000)]
Filter_df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years)
2,2,3,Alice Lee,IT,70000,2016-03-11,7

In [163]:
# 3. Add a Column: Add a new column called Bonus where the bonus is 10% of the Salary.
df1["Bonus"]=df1["Salary"]*10/100
df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years),Bonus
0,0,1,John Smith,IT,60000,2018-05-21,5,6000.0
1,1,2,Jane Doe,HR,50000,2020-07-15,3,5000.0
2,2,3,Alice Lee,IT,70000,2016-03-11,7,7000.0
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4,4500.0
4,4,5,Emma Green,HR,55000,2021-06-25,2,5500.0

In [164]:
# 4. Date Handling: Extract the year and month from the Joining Date column and create new columns called Year and Month.
#    Convert Joining Date column to datetime format
df1["Joining Date"] = pd.to_datetime(df1["Joining Date"])
df1
# Extract Year and Month
df1["Year"] = df1["Joining Date"].dt.year
df1["Month"] = df1["Joining Date"].dt.month
# Display the updated DataFrame
df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years),Bonus,Year,Month
0,0,1,John Smith,IT,60000,2018-05-21,5,6000.0,2018,5
1,1,2,Jane Doe,HR,50000,2020-07-15,3,5000.0,2020,7
2,2,3,Alice Lee,IT,70000,2016-03-11,7,7000.0,2016,3
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4,4500.0,2019,1
4,4,5,Emma Green,HR,55000,2021-06-25,2,5500.0,2021,6

In [165]:
# 5. Group by: Group the data by Department and calculate the average salary in each department.
Avg_Salary=df1.groupby("Department")["Salary"].mean()
Avg_Salary

Department
HR           52500.0
IT           65000.0
Marketing    45000.0
Name: Salary, dtype: float64

In [166]:
#  6. Sort: Sort the DataFrame by Experience (Years) in ascending order.
sorted_df1 = df1.sort_values("Year", ascending=True)
sorted_df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years),Bonus,Year,Month
2,2,3,Alice Lee,IT,70000,2016-03-11,7,7000.0,2016,3
0,0,1,John Smith,IT,60000,2018-05-21,5,6000.0,2018,5
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4,4500.0,2019,1
1,1,2,Jane Doe,HR,50000,2020-07-15,3,5000.0,2020,7
4,4,5,Emma Green,HR,55000,2021-06-25,2,5500.0,2021,6

In [167]:
# 7. Conditional Replacement: Replace the Department name "HR" with "Human Resources".
df1["Department"] = df1["Department"].replace("HR", "Human Resources")
df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years),Bonus,Year,Month
0,0,1,John Smith,IT,60000,2018-05-21,5,6000.0,2018,5
1,1,2,Jane Doe,Human Resources,50000,2020-07-15,3,5000.0,2020,7
2,2,3,Alice Lee,IT,70000,2016-03-11,7,7000.0,2016,3
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4,4500.0,2019,1
4,4,5,Emma Green,Human Resources,55000,2021-06-25,2,5500.0,2021,6

In [168]:
# 8. Aggregate Function: Find the total and average salary of all employees.
total_salary = df1["Salary"].sum()
average_salary = df1["Salary"].mean()
print(f"Total Salary = {total_salary}")
print(f"Average Salary = {average_salary}")

Total Salary = 280000
Average Salary = 56000.0

In [169]:
# 9. String Operations: Create a new column called Name Length that contains the length of each employee's name.
df1["Name Length"]=df1["Name"].apply(len)
df1

,Unnamed: 0,ID,Name,Department,Salary,Joining Date,Experience (Years),Bonus,Year,Month,Name Length
0,0,1,John Smith,IT,60000,2018-05-21,5,6000.0,2018,5,10
1,1,2,Jane Doe,Human Resources,50000,2020-07-15,3,5000.0,2020,7,8
2,2,3,Alice Lee,IT,70000,2016-03-11,7,7000.0,2016,3,9
3,3,4,Bob Brown,Marketing,45000,2019-01-10,4,4500.0,2019,1,9
4,4,5,Emma Green,Human Resources,55000,2021-06-25,2,5500.0,2021,6,10

In [170]:
# 10. Duplicates: Check if there are any duplicate rows in the dataset
# Check for duplicate rows
duplicates = df1.duplicated()

# Display boolean series indicating duplicate rows
print(duplicates)

# To see the duplicate rows themselves (if any)
duplicate_rows = df1[df1.duplicated()]
print(duplicate_rows)

0    False
1    False
2    False
3    False
4    False
dtype: bool
Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Department, Salary, Joining Date, Experience (Years), Bonus, Year, Month, Name Length]
Index: []

In [171]:
# Export Data: Save the updated DataFrame to a CSV file named employee_data_updated.csv.
df1.to_csv('F:/Pandas Practice Data/employee_data_updated.csv', index=False)

In [146]:
df2.to_csv('F:/Pandas Practice Data/sales_data.csv', index=False)